; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	infrared5 - mode
	spectrograph3 - mode
	thermograph0 - mode
	spectrograph1 - mode
	infrared4 - mode
	spectrograph2 - mode
	thermograph6 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation7 - direction
	GroundStation9 - direction
	GroundStation1 - direction
	GroundStation8 - direction
	Star6 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Star13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 infrared5)
	(supports instrument0 infrared4)
	(supports instrument0 thermograph6)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph1)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 GroundStation8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
)
(:goal (and
	(have_image Planet10 thermograph6)
	(have_image Star11 infrared5)
	(have_image Planet12 spectrograph1)
	(have_image Star13 spectrograph1)
	(have_image Phenomenon14 spectrograph2)
))

)

; plan
1. (turn_to satellite0 groundstation1 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 5
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
3. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 5
4. (turn_to satellite0 planet10 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet10)
   goals met: 0 of 5
5. (take_image satellite0 planet10 instrument0 thermograph6)
   added: (have_image planet10 thermograph6)
   goals met: 1 of 5
6. (turn_to satellite0 phenomenon14 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon14)
   goals met: 1 of 5
7. (take_image satellite0 phenomenon14 instrument0 spectrograph2)
   added: (have_image phenomenon14 spectrograph2)
   goals met: 2 of 5
8. (turn_to satellite0 star11 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star11)
   goals met: 2 of 5
9. (take_image satellite0 star11 instrument0 infrared5)
   added: (have_image star11 infrared5)
   goals met: 3 of 5
10. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 3 of 5
11. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 5
12. (turn_to satellite0 groundstation8 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation8)
   goals met: 3 of 5
13. (calibrate satellite0 instrument1 groundstation8)
   added: (calibrated instrument1)
   goals met: 3 of 5
14. (turn_to satellite0 planet12 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 planet12)
   goals met: 3 of 5
15. (take_image satellite0 planet12 instrument1 spectrograph1)
   added: (have_image planet12 spectrograph1)
   goals met: 4 of 5
16. (turn_to satellite0 star13 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star13)
   goals met: 4 of 5
17. (take_image satellite0 star13 instrument1 spectrograph1)
   added: (have_image star13 spectrograph1)
   goals met: 5 of 5
